// pages/note/note.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    note_list: [{
      day: 23,
      date: '2213/2',
      list: ['淡蓝色和粉色的搭配多用于表达爱情等主题，同时也是夏天的标准配色，明亮的粉色和蓝色给人舒畅和清凉的感觉，整个配色明度较高，色彩纯度较高却并不显得过分绚丽，也常用于表达小资情调的设计中。','新的项目添加到列表']
    },
    {
      day: 1,
      date: '2213/2',
      list: ['淡蓝色和粉色的搭配多用于表达爱情等主题，同时也是夏天的标准配色，明亮的粉色和蓝色给人舒畅和清凉的感觉，整个配色明度较高，色彩纯度较高却并不显得过分绚丽，也常用于表达小资情调的设计中。', '新的项目添加到列表']
    },
    {
      day: 12,
      date: '2213/2',
      list: ['果列表中项目的位置', '新的项目添加到列表']
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})